In [1]:
person = {
    "first": "Abanoub",
    "last": "Refaat",
    "email": "abanoub@email.com"
}

In [2]:
people = {
    "first": ["Abanoub"],
    "last": ["Refaat"],
    "email": ["abanoub@email.com"]
}

In [55]:
people = {
    "first": ["Abanoub", "Ebram", "Fady","John","Jane"],
    "last": ["Refaat", "Wael", "Mounir","Doe", "Doe"],
    "email": ["abanoub@email.com", "ebram@email.com", "fady@email.com", "john@email.com", "jane@gmail.com"]
}

In [4]:
people["email"]

['abanoub@email.com',
 'ebram@email.com',
 'fady@email.com',
 'john@email.com',
 'jane@gmail.com']

In [56]:
import pandas as pd

In [57]:
df = pd.DataFrame(people)

In [58]:
df

     first    last              email
0  Abanoub  Refaat  abanoub@email.com
1    Ebram    Wael    ebram@email.com
2     Fady  Mounir     fady@email.com
3     John     Doe     john@email.com
4     Jane     Doe     jane@gmail.com

In [8]:
df["email"]

0    abanoub@email.com
1      ebram@email.com
2       fady@email.com
3       john@email.com
4       jane@gmail.com
Name: email, dtype: object

In [9]:
df.email

0    abanoub@email.com
1      ebram@email.com
2       fady@email.com
3       john@email.com
4       jane@gmail.com
Name: email, dtype: object

In [10]:
type(df["email"])

pandas.core.series.Series

In [11]:
df[["last", "email"]]

     last              email
0  Refaat  abanoub@email.com
1    Wael    ebram@email.com
2  Mounir     fady@email.com
3     Doe     john@email.com
4     Doe     jane@gmail.com

In [12]:
type(df[["last", "email"]])

pandas.core.frame.DataFrame

In [13]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [14]:
df.iloc[[0, 1]] #integer location

     first    last              email
0  Abanoub  Refaat  abanoub@email.com
1    Ebram    Wael    ebram@email.com

In [15]:
df.iloc[[0, 1], 2]

0    abanoub@email.com
1      ebram@email.com
Name: email, dtype: object

In [16]:
df.loc[0] # labeled location

first              Abanoub
last                Refaat
email    abanoub@email.com
Name: 0, dtype: object

In [17]:
df.loc[[0, 1], ["email", "last"]] # in the same order email then last

               email    last
0  abanoub@email.com  Refaat
1    ebram@email.com    Wael

In [18]:
df.set_index("email", inplace=True)
df

                     first    last
email
abanoub@email.com  Abanoub  Refaat
ebram@email.com      Ebram    Wael
fady@email.com        Fady  Mounir
john@email.com        John     Doe
jane@gmail.com        Jane     Doe

In [19]:
df.index

Index(['abanoub@email.com', 'ebram@email.com', 'fady@email.com',
       'john@email.com', 'jane@gmail.com'],
      dtype='object', name='email')

In [20]:
df.loc["abanoub@email.com", "last"]

'Refaat'

In [21]:
df.reset_index(inplace=True)
df

               email    first    last
0  abanoub@email.com  Abanoub  Refaat
1    ebram@email.com    Ebram    Wael
2     fady@email.com     Fady  Mounir
3     john@email.com     John     Doe
4     jane@gmail.com     Jane     Doe

In [22]:
filt = (df["last"] == "Doe")

In [23]:
df[filt]

            email first last
3  john@email.com  John  Doe
4  jane@gmail.com  Jane  Doe

In [24]:
df.loc[filt, "email"] #df.loc[filter rows, cols]

3    john@email.com
4    jane@gmail.com
Name: email, dtype: object

In [25]:
filt = (df["last"] == "Doe") | (df["first"] == "Jane")
df.loc[~filt, "email"] # we use ~ is for negation instade of !

0    abanoub@email.com
1      ebram@email.com
2       fady@email.com
Name: email, dtype: object

In [26]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [27]:
#renaming the columns
df.columns = ["first_name", "last_name", "email"]

In [28]:
df

          first_name last_name   email
0  abanoub@email.com   Abanoub  Refaat
1    ebram@email.com     Ebram    Wael
2     fady@email.com      Fady  Mounir
3     john@email.com      John     Doe
4     jane@gmail.com      Jane     Doe

In [29]:
df.columns = [x.lower() for x in df.columns]

In [30]:
df.columns = df.columns.str.replace(" ", "_")

In [31]:
# using the rename method
df.rename(columns={"first_name": "first", "last_name": "last"}, inplace=True)

In [32]:
df

               first     last   email
0  abanoub@email.com  Abanoub  Refaat
1    ebram@email.com    Ebram    Wael
2     fady@email.com     Fady  Mounir
3     john@email.com     John     Doe
4     jane@gmail.com     Jane     Doe

In [33]:
df.loc[3] = ["John", "Snow", "johnSnow@gmail.com"]

In [34]:
df

               first     last               email
0  abanoub@email.com  Abanoub              Refaat
1    ebram@email.com    Ebram                Wael
2     fady@email.com     Fady              Mounir
3               John     Snow  johnSnow@gmail.com
4     jane@gmail.com     Jane                 Doe

In [35]:
df.loc[3, "first"] = "Aroen"

In [36]:
filt = (df["email"] == "johnSnow@gmail.com")
df[filt]["last"]

3    Snow
Name: last, dtype: object

In [38]:
df["email"] =df['email'].str.lower()

In [59]:
#apply map applymap replace methods

df['email'].apply(len) #calculate the lenght of each el in the series.

0    17
1    15
2    14
3    14
4    14
Name: email, dtype: int64

In [42]:
def update_email(email):
    return email.upper()

In [45]:
df["email"] = df["email"].apply(lambda x: x.lower())

In [46]:
df["email"].apply(len)

0     6
1     4
2     6
3    18
4     3
Name: email, dtype: int64

In [60]:
df.apply(len, axis="columns")

0    3
1    3
2    3
3    3
4    3
dtype: int64

In [ ]:
df.apply(pd.Series.min) # min values for each el

first      Aroen
last     Abanoub
email        doe
dtype: object

In [61]:
df.apply(lambda x: x.min()) # same as the last example

first              Abanoub
last                   Doe
email    abanoub@email.com
dtype: object

In [54]:
# apply maps only work on dataFrams
# applymap is deprecated its been map.
df.map(len)

   first  last  email
0     17     7      6
1     15     5      4
2     14     4      6
3      5     4     18
4     14     4      3

In [ ]:
df.map(str.lower)

In [62]:
df["full_name"] = df["first"] + " " + df["last"]

In [63]:
df

     first    last              email       full_name
0  Abanoub  Refaat  abanoub@email.com  Abanoub Refaat
1    Ebram    Wael    ebram@email.com      Ebram Wael
2     Fady  Mounir     fady@email.com     Fady Mounir
3     John     Doe     john@email.com        John Doe
4     Jane     Doe     jane@gmail.com        Jane Doe

In [64]:
df.drop(columns=["first", "last"])

               email       full_name
0  abanoub@email.com  Abanoub Refaat
1    ebram@email.com      Ebram Wael
2     fady@email.com     Fady Mounir
3     john@email.com        John Doe
4     jane@gmail.com        Jane Doe

In [66]:
df["full_name"].str.split(' ', expand=True)

         0       1
0  Abanoub  Refaat
1    Ebram    Wael
2     Fady  Mounir
3     John     Doe
4     Jane     Doe

In [67]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand=True)

In [68]:
df

     first    last              email       full_name
0  Abanoub  Refaat  abanoub@email.com  Abanoub Refaat
1    Ebram    Wael    ebram@email.com      Ebram Wael
2     Fady  Mounir     fady@email.com     Fady Mounir
3     John     Doe     john@email.com        John Doe
4     Jane     Doe     jane@gmail.com        Jane Doe

In [72]:
df._append({"first": "Tony"}, ignore_index=True)

     first    last              email       full_name
0  Abanoub  Refaat  abanoub@email.com  Abanoub Refaat
1    Ebram    Wael    ebram@email.com      Ebram Wael
2     Fady  Mounir     fady@email.com     Fady Mounir
3     John     Doe     john@email.com        John Doe
4     Jane     Doe     jane@gmail.com        Jane Doe
5     Tony     NaN                NaN             NaN

In [74]:
people = {
    "first": ["Jon", "Arya", "Ned"],
    "last": ["Snow", "Stark", "Stark"],
    "email": ["jontargaryan@email.com", "arya@starks.com", "ned@starks.com"]
}
df2 = pd.DataFrame(people)
df2

  first   last                   email
0   Jon   Snow  jontargaryan@email.com
1  Arya  Stark         arya@starks.com
2   Ned  Stark          ned@starks.com

In [76]:
df._append(df2, ignore_index=True)

     first    last                   email       full_name
0  Abanoub  Refaat       abanoub@email.com  Abanoub Refaat
1    Ebram    Wael         ebram@email.com      Ebram Wael
2     Fady  Mounir          fady@email.com     Fady Mounir
3     John     Doe          john@email.com        John Doe
4     Jane     Doe          jane@gmail.com        Jane Doe
5      Jon    Snow  jontargaryan@email.com             NaN
6     Arya   Stark         arya@starks.com             NaN
7      Ned   Stark          ned@starks.com             NaN